Tekla Open API Reference for Tekla Structures 2025
ImageComboBox.OptionList Property
 Gets or sets the elements of the option list, the images that are in the image combo box.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ImageList OptionList { get; set; }
Public Property OptionList As ImageList
	Get
	Set
Property Value
Type: ImageList
See Also
Reference
ImageComboBox Class
Tekla.Structures.Dialog.UIControls Namespace